# Creating a DataFrame

In [1]:
import pandas as pd

In [3]:
data = pd.DataFrame()

In [4]:
data['Name'] = ['Meet','Mit','Abhijit']
data['Age'] = [20,21,19]
data['Passport'] = [True,False,False]

In [5]:
data

      Name  Age  Passport
0     Meet   20      True
1      Mit   21     False
2  Abhijit   19     False

In [11]:
# adding new row to the data
# Creating a new data using Series
new_data = pd.Series(['Raj',19,False],index=['Name','Age','Passport'])

# Appending new series to the dataframe
data = data.append(new_data,ignore_index=True)

In [12]:
data

      Name  Age  Passport
0     Meet   20      True
1      Mit   21     False
2  Abhijit   19     False
3      Raj   19     False
4      Raj   19     False

## Describing the data

In [13]:
data.head(2)

   Name  Age  Passport
0  Meet   20      True
1   Mit   21     False

In [14]:
#checking the shape and size of data
data.shape

(5, 3)

In [15]:
data.describe()

             Age
count   5.000000
mean   19.600000
std     0.894427
min    19.000000
25%    19.000000
50%    19.000000
75%    20.000000
max    21.000000

## Selecting Individual Data and Slicing

In [16]:
data.iloc[0]

Name        Meet
Age           20
Passport    True
Name: 0, dtype: object

In [17]:
data.iloc[0:2]

   Name  Age  Passport
0  Meet   20      True
1   Mit   21     False

## Conditional Selection of Rows

In [18]:
# Let's make a few changes to our data
#adding few more Series
new_data1 = pd.Series(['Ram',15,False],index=['Name','Age','Passport'])
new_data2 = pd.Series(['Shyam',19,True],index=['Name','Age','Passport'])
new_data3 = pd.Series(['Yukta',18,False],index=['Name','Age','Passport'])
new_data4 = pd.Series(['Venkat',20,False],index=['Name','Age','Passport'])

# appending Series to the DataFrame
data = data.append(new_data1,ignore_index = True)
data = data.append(new_data2,ignore_index = True)
data = data.append(new_data3,ignore_index = True)
data = data.append(new_data4,ignore_index = True)

In [19]:
data

      Name  Age  Passport
0     Meet   20      True
1      Mit   21     False
2  Abhijit   19     False
3      Raj   19     False
4      Raj   19     False
5      Ram   15     False
6    Shyam   19      True
7    Yukta   18     False
8   Venkat   20     False

In [20]:
data[data['Passport'] == True]

    Name  Age  Passport
0   Meet   20      True
6  Shyam   19      True

In [21]:
data[data['Passport'] == False]

      Name  Age  Passport
1      Mit   21     False
2  Abhijit   19     False
3      Raj   19     False
4      Raj   19     False
5      Ram   15     False
7    Yukta   18     False
8   Venkat   20     False

In [22]:
data[data['Age'] == 19]

      Name  Age  Passport
2  Abhijit   19     False
3      Raj   19     False
4      Raj   19     False
6    Shyam   19      True

## Finding Unique Values

In [23]:
data['Passport'].unique()

array([ True, False])

In [24]:
data['Age'].unique()

array([20, 21, 19, 15, 18], dtype=int64)